[
  { "name": "Smith", "origin": "English", "syllables": 1, "note": "One of the most common English surnames; pairs well with first names that have clear vowel endings or balanced syllables." },
  { "name": "Johnson", "origin": "English", "syllables": 2, "note": "Patronymic English surname; flows well with first names that avoid a heavy \"n\" at the end." },
  { "name": "Williams", "origin": "Welsh", "syllables": 2, "note": "Welsh-origin surname common in English-speaking countries; works with a variety of first name lengths and sounds." },
  { "name": "Brown", "origin": "English", "syllables": 1, "note": "Short English surname; one-syllable first names can work but longer names with a soft ending often balance well." },
  { "name": "Jones", "origin": "Welsh", "syllables": 1, "note": "Classic Welsh patronymic; pairs nicely with first names ending in a vowel or with two syllables." },
  { "name": "Garcia", "origin": "Spanish", "syllables": 2, "note": "Spanish surname with strong Hispanic heritage; culturally pairs well with Spanish, Latin, or multicultural first names." },
  { "name": "Miller", "origin": "English", "syllables": 2, "note": "Occupational English surname; smooth with first names that end in a vowel or have a clear consonant-vowel transition." },
  { "name": "Davis", "origin": "Welsh", "syllables": 2, "note": "Welsh-derived surname; avoids first names ending in \"s\" to prevent a run-on sound." },
  { "name": "Rodriguez", "origin": "Spanish", "syllables": 3, "note": "Spanish patronymic; longer last name often balances with medium-length first names and Spanish or Latin first names." },
  { "name": "Martinez", "origin": "Spanish", "syllables": 3, "note": "Common Spanish surname; pairs well with first names that don’t end in \"z\" or \"s\" for clear separation." },
  { "name": "Wilson", "origin": "English", "syllables": 2, "note": "English patronymic; works with first names ending in a vowel or with a different final consonant." },
  { "name": "Nguyen", "origin": "Vietnamese", "syllables": 1, "note": "Very common Vietnamese surname; pairs well with Vietnamese names or short, clear first names in any language." },
  { "name": "Anderson", "origin": "Scandinavian", "syllables": 3, "note": "Scandinavian patronymic; longer last name suits one- or two-syllable first names for balance." },
  { "name": "Thomas", "origin": "Welsh", "syllables": 2, "note": "Biblical and Welsh surname; avoid first names ending in \"s\" for cleaner flow." },
  { "name": "Taylor", "origin": "English", "syllables": 2, "note": "Occupational English surname; pairs well with first names that end in a vowel or have two syllables." },
  { "name": "Moore", "origin": "English", "syllables": 1, "note": "Short English surname; one-syllable first names can create a strong, balanced full name." },
  { "name": "Jackson", "origin": "English", "syllables": 2, "note": "English patronymic; avoid first names ending in \"n\" to prevent a nasal run-on with \"Jackson.\"" },
  { "name": "Martin", "origin": "Latin", "syllables": 2, "note": "Latin-origin surname used in French and English; versatile with many first name styles." },
  { "name": "Lee", "origin": "English", "syllables": 1, "note": "Short surname (also common in Korean and Chinese); works with longer first names for balance." },
  { "name": "Thompson", "origin": "English", "syllables": 2, "note": "English patronymic; first names ending in a vowel or with two syllables often flow well." },
  { "name": "Patel", "origin": "Indian", "syllables": 2, "note": "Common Indian (Gujarati) surname; pairs well with Indian, Sanskrit, or multicultural first names." },
  { "name": "Kim", "origin": "Korean", "syllables": 1, "note": "Very common Korean surname; short last name suits two- or three-syllable first names." },
  { "name": "Singh", "origin": "Indian", "syllables": 1, "note": "Sikh/Punjabi surname; works with Indian, Punjabi, or modern first names." }
]
